---
kind: method
id: M:Autodesk.Revit.DB.ExternallyTaggedGeometryObject.Dispose
source: html/68014f53-be9e-1d8b-f882-55bd9aeb39ff.htm
---
# Autodesk.Revit.DB.ExternallyTaggedGeometryObject.Dispose Method

Releases all resources used by the ExternallyTaggedGeometryObject

## Syntax (C#)
```csharp
public void Dispose()
```